#!/bin/bash
# shell编程基础

#############################################################################
# 1.需要为文件添加可执行权限，才能运行该shell脚本
#   chmod +x 01_Hello.sh
#############################################################################
# 2.字符串输出
echo 'I want say "Hello":'
who
# 是可以不实用引号来输出字符串的，但是如果想要输出“”，那就需要引号的嵌套使用了
echo -n 'I want say "Hello":'
who
# 通过-n,可以将文字字符串与命令的输出显示同一行
echo UID: $UID
# 通过$变量名，来获取系统变量

#############################################################################
# 3.用户自定义变量
var1=10
var2=testing
var3="go home"
# shell的自定义变量区分大小，并且变量名和变量值用等号连接，不能出现空格

echo $var3
# 用户自定义变量也需要用$来引用
# 引用变量的值需要加$，但对变量进行赋值则不需要

#############################################################################
# 4.命令替换：将命令的输出保存到变量中，有2种方式，`command` 和$(格式)
var_ls=`ls`
echo $var_ls

var_ls2=$(ls)
echo $var_ls2
#############################################################################
# 5.重定向输入输出